_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РазделительнаяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РазделительнаяВедомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_РазделительнаяВедомостьМатериалы</xr:Item>
				<xr:Item>InformationRegister.УСОERP_РазделительнаяВедомостьРаботы</xr:Item>
				<xr:Item>InformationRegister.УСОERP_РазделительнаяВедомостьРесурсы</xr:Item>
				<xr:Item>InformationRegister.УСОERP_ЦенаПодрядчикаВРазделительнойВедомости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемСобственный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемСубподряда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаказчика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПодрядчикаКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПодрядчикаЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПодрядчикаРазность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСобственное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСубподряда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСобственное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСубподряда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПланов</Name>
			<Comment>Статусы планов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РазделительнаяВедомость/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаРазделительнаяВедомостьРаботы(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРазделительнаяВедомостьМатериалы(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРазделительнаяВедомостьРесурсы(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаУСОERP_ЦенаПодрядчикаВРазделительнойВедомости(Запрос, ТекстыЗапроса, Регистры);
	//ТекстыЗапроса.Добавить(ТекстЗапросаТаблицаРазделительнаяВедомостьРаботы(), "ТаблицаРазделительнаяВедомостьРаботы");
	//ТекстыЗапроса.Добавить(ТекстЗапросаТаблицаРазделительнаяВедомостьМатериалы(), "ТаблицаРазделительнаяВедомостьМатериалы");
	//ТекстыЗапроса.Добавить(ТекстЗапросаТаблицаРазделительнаяВедомостьРесурсы(), "ТаблицаРазделительнаяВедомостьРесурсы");
	//ТекстыЗапроса.Добавить(ТекстЗапросаТаблицаУСОERP_ЦенаПодрядчикаВРазделительнойВедомости(),"ТаблицаУСОERP_ЦенаПодрядчикаВРазделительнойВедомости");
	
	////////////////////////////////////////////////////////////////////////////
	// Выполним запрос и поместим результаты запроса в дополнительные свойства
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений,Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ОбъектСтроительства КАК ОбъектСтроительства
	|ИЗ
	|	Документ.УСОERP_РазделительнаяВедомость КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	////////////////////////////////////////////////////////////////////////////
	// Уставноим параметры запроса
	
	Для Каждого Колонка из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

КонецПроцедуры

Функция ТекстЗапросаТаблицаРазделительнаяВедомостьРаботы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "УСОERP_РазделительнаяВедомостьРаботы";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	&Период КАК Период,
	|	&Период КАК ДатаРегистратора,
	|	&ОбъектСтроительства КАК ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Работа
	|		ИНАЧЕ ТаблицаДокумента.Работа.РаботаИсточник
	|	КОНЕЦ КАК Работа,
	|	ТаблицаДокумента.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ТаблицаДокумента.Подразделение КАК Подразделение,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	СУММА(ТаблицаДокумента.ОбъемСобственный) КАК ОбъемСобственный,
	|	СУММА(ТаблицаДокумента.ОбъемСубподряда) КАК ОбъемСубподряда
	|ИЗ
	|	Документ.УСОERP_РазделительнаяВедомость.Работы КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.ОбъемСобственный <> 0
	|			ИЛИ ТаблицаДокумента.ОбъемСубподряда <> 0)
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И НЕ ТаблицаДокумента.Работа.СуммарнаяРабота
	|	И ТаблицаДокумента.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Работа
	|		ИНАЧЕ ТаблицаДокумента.Работа.РаботаИсточник
	|	КОНЕЦ,
	|	ТаблицаДокумента.ЕдиницаОбъема,
	|	ТаблицаДокумента.Подразделение,
	|	ТаблицаДокумента.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса,"ТаблицаРазделительнаяВедомостьРаботы");

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРазделительнаяВедомостьМатериалы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "УСОERP_РазделительнаяВедомостьМатериалы";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	&Период КАК Период,
	|	&Период КАК ДатаРегистратора,
	|	&ОбъектСтроительства КАК ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Работа
	|		ИНАЧЕ ТаблицаДокумента.Работа.РаботаИсточник
	|	КОНЕЦ КАК Работа,
	|	ТаблицаДокумента.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	СУММА(ТаблицаДокумента.КоличествоСобственное) КАК КоличествоСобственное,
	|	СУММА(ТаблицаДокумента.КоличествоСубподряда) КАК КоличествоСубподряда
	|ИЗ
	|	Документ.УСОERP_РазделительнаяВедомость.Материалы КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.КоличествоСобственное <> 0
	|			ИЛИ ТаблицаДокумента.КоличествоСубподряда <> 0)
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И НЕ ТаблицаДокумента.Работа.СуммарнаяРабота
	|	И ТаблицаДокумента.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Работа
	|		ИНАЧЕ ТаблицаДокумента.Работа.РаботаИсточник
	|	КОНЕЦ,
	|	ТаблицаДокумента.ЕдиницаОбъема,
	|	ТаблицаДокумента.Номенклатура,
	|	ТаблицаДокумента.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса,"ТаблицаРазделительнаяВедомостьМатериалы");

	Возврат ТекстЗапроса;  
	
КонецФункции

Функция ТекстЗапросаТаблицаРазделительнаяВедомостьРесурсы(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "УСОERP_РазделительнаяВедомостьРесурсы";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	&Период КАК Период,
	|	&Период КАК ДатаРегистратора,
	|	&ОбъектСтроительства КАК ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Работа
	|		ИНАЧЕ ТаблицаДокумента.Работа.РаботаИсточник
	|	КОНЕЦ КАК Работа,
	|	ТаблицаДокумента.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ТаблицаДокумента.Ресурс КАК Ресурс,
	|	СУММА(ТаблицаДокумента.КоличествоСобственное) КАК КоличествоСобственное,
	|	СУММА(ТаблицаДокумента.КоличествоСубподряда) КАК КоличествоСубподряда
	|ИЗ
	|	Документ.УСОERP_РазделительнаяВедомость.Ресурсы КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.КоличествоСобственное <> 0
	|			ИЛИ ТаблицаДокумента.КоличествоСубподряда <> 0)
	|	И ТаблицаДокумента.Ссылка = &Ссылка
	|	И НЕ ТаблицаДокумента.Работа.СуммарнаяРабота
	|	И ТаблицаДокумента.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Работа.РаботаИсточник = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Работа
	|		ИНАЧЕ ТаблицаДокумента.Работа.РаботаИсточник
	|	КОНЕЦ,
	|	ТаблицаДокумента.ЕдиницаОбъема,
	|	ТаблицаДокумента.Ресурс
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса,"ТаблицаРазделительнаяВедомостьРесурсы");

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаУСОERP_ЦенаПодрядчикаВРазделительнойВедомости(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "УСОERP_ЦенаПодрядчикаВРазделительнойВедомости";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;   
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ТаблицаДокумента.Ссылка.ОбъектСтроительства КАК ОбъектСтроительства,
	|	ТаблицаДокумента.Ссылка.СценарийПланирования КАК СценарийПланирования,
	|	ТаблицаДокумента.Работа КАК Работа,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.ДокументУтверждения КАК ДокументУтверждения,
	|	ТаблицаДокумента.Ссылка.Организация КАК Организация,
	|	ТаблицаДокумента.ЦенаПодрядчикаЦена КАК ЦенаПодрядчика
	|ИЗ
	|	Документ.УСОERP_РазделительнаяВедомость.Работы КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И ТаблицаДокумента.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
	|	И ТаблицаДокумента.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И НЕ ТаблицаДокумента.Работа.СуммарнаяРабота
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаДокумента.НомерСтроки"; 	

    ТекстыЗапроса.Добавить(ТекстЗапроса,"ТаблицаУСОERP_ЦенаПодрядчикаВРазделительнойВедомости");

	Возврат ТекстЗапроса;  
	
КонецФункции

#КонецОбласти

#Область Отчеты
	// Определяет список команд отчетов.
	//
	// Параметры:
	//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
	//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
	//   Параметры - Структура - Вспомогательные параметры. Для чтения.
	//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
	//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
		
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
КонецПроцедуры
	
#КонецОбласти 

#Область СозданиеНаОсновании

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании,Параметры) Экспорт
	
КонецПроцедуры

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
// Возвращаемое значение:
//	 КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт		
		
	КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
	КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.УСОERP_РазделительнаяВедомость.ПолноеИмя();
	КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.УСОERP_РазделительнаяВедомость);
	КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
	
	Возврат КомандаСоздатьНаОсновании;
	
КонецФункции

#КонецОбласти 


#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецЕсли
